mikaelpatel/Cosa/boards.txt
# @file boards.txt
# @version 1.0
#
# @section License
# Copyright (C) 2013-2015, Mikael Patel
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
# Lesser General Public License for more details.
#
# @section Description
# The Cosa Arduino core boards definition file; in alfabetical order.
# The default setting is the composition of the supported boards.
# See the directory boards.
#
# This file is part of the Arduino Che Cosa project.

##
# ARDUINO BOARDS
##

# AVR:ATmega168
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0x1c00).
diecimila.name=Cosa Arduino Diecimila (ATmega168/BOOT_168)
diecimila.upload.tool=avrdude
diecimila.upload.protocol=arduino
diecimila.upload.maximum_size=14336
diecimila.upload.maximum_data_size=1024
diecimila.upload.maximum_eeprom_size=512
diecimila.upload.speed=19200

diecimila.bootloader.tool=avrdude
diecimila.bootloader.low_fuses=0xff
diecimila.bootloader.high_fuses=0xdd
diecimila.bootloader.extended_fuses=0x00

diecimila.build.mcu=atmega168
diecimila.build.f_cpu=16000000L
diecimila.build.board=ARDUINO_DIECIMILA
diecimila.build.variant=arduino/diecimila
diecimila.build.core=Cosa:cosa

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0x3c00).
duemilanove.name=Cosa Arduino Duemilanove (ATmega328/BOOT_168)
duemilanove.upload.tool=avrdude
duemilanove.upload.protocol=arduino
duemilanove.upload.maximum_size=30720
duemilanove.upload.maximum_data_size=2048
duemilanove.upload.maximum_eeprom_size=1024
duemilanove.upload.speed=57600

duemilanove.bootloader.tool=avrdude
duemilanove.bootloader.low_fuses=0xff
duemilanove.bootloader.high_fuses=0xda
duemilanove.bootloader.extended_fuses=0x05

duemilanove.build.mcu=atmega328p
duemilanove.build.f_cpu=16000000L
duemilanove.build.board=ARDUINO_DUEMILANOVE
duemilanove.build.variant=arduino/duemilanove
duemilanove.build.core=Cosa:cosa

# AVR:ATmega32U4
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.6 V. Serial program downloading enabled
# Boot Reset vector enable (2048 words, 0x3800).
leonardo.name=Cosa Arduino Leonardo (ATmega32U4/Caterina)
leonardo.upload.tool=avrdude
leonardo.upload.protocol=avr109
leonardo.upload.maximum_size=28672
leonardo.upload.maximum_data_size=2560
leonardo.upload.maximum_eeprom_size=1024
leonardo.upload.speed=57600
leonardo.upload.disable_flushing=true
leonardo.upload.use_1200bps_touch=true
leonardo.upload.wait_for_upload_port=true

leonardo.bootloader.path=caterina
leonardo.bootloader.tool=avrdude
leonardo.bootloader.low_fuses=0xff
leonardo.bootloader.high_fuses=0xd8
leonardo.bootloader.extended_fuses=0xcb

leonardo.build.mcu=atmega32u4
leonardo.build.f_cpu=16000000L
leonardo.build.vid=0x2341
leonardo.build.pid=0x8036
leonardo.build.usb_product="Arduino Leonardo"
leonardo.build.board=ARDUINO_LEONARDO
leonardo.build.variant=arduino/leonardo
leonardo.build.extra_flags={build.usb_flags}
leonardo.build.core=Cosa:cosa

# AVR:ATmega1280
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (2048 words, 0xf800).
mega1280.name=Cosa Arduino Mega (ATmega1280/BOOT_168)
mega1280.upload.tool=avrdude
mega1280.upload.protocol=arduino
mega1280.upload.maximum_size=126976
mega1280.upload.maximum_data_size=8192
mega1280.upload.maximum_eeprom_size=4096
mega1280.upload.speed=57600

mega1280.bootloader.tool=avrdude
mega1280.bootloader.low_fuses=0xff
mega1280.bootloader.high_fuses=0xda
mega1280.bootloader.extended_fuses=0xf5

mega1280.build.mcu=atmega1280
mega1280.build.f_cpu=16000000L
mega1280.build.board=ARDUINO_MEGA1280
mega1280.build.variant=arduino/mega1280
mega1280.build.core=Cosa:cosa

# AVR:ATmega2560
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (4096 words, 0x1f000).
mega2560.name=Cosa Arduino Mega (ATmega2560/STK500v2)
mega2560.upload.tool=avrdude
mega2560.upload.protocol=wiring
mega2560.upload.maximum_size=253952
mega2560.upload.maximum_data_size=8192
mega2560.upload.maximum_eeprom_size=4096
mega2560.upload.speed=115200

mega2560.bootloader.tool=avrdude
mega2560.bootloader.low_fuses=0xff
mega2560.bootloader.high_fuses=0xd8
mega2560.bootloader.extended_fuses=0xfd

mega2560.build.mcu=atmega2560
mega2560.build.f_cpu=16000000L
mega2560.build.board=ARDUINO_MEGA2560
mega2560.build.variant=arduino/mega2560
mega2560.build.core=Cosa:cosa

# AVR:ATmega32U4
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.6 V. Serial program downloading enabled
# Boot Reset vector enable (2048 words, 0x3800).
micro.name=Cosa Arduino Micro (ATmega32U4/Caterina)
micro.upload.tool=avrdude
micro.upload.protocol=avr109
micro.upload.maximum_size=28672
micro.upload.maximum_data_size=2560
micro.upload.maximum_eeprom_size=1024
micro.upload.speed=57600
micro.upload.disable_flushing=true
micro.upload.use_1200bps_touch=true
micro.upload.wait_for_upload_port=true

micro.bootloader.path=caterina
micro.bootloader.tool=avrdude
micro.bootloader.low_fuses=0xff
micro.bootloader.high_fuses=0xd8
micro.bootloader.extended_fuses=0xcb

micro.build.mcu=atmega32u4
micro.build.f_cpu=16000000L
micro.build.vid=0x2341
micro.build.pid=0x8037
micro.build.usb_product="Arduino Micro"
micro.build.board=ARDUINO_MICRO
micro.build.variant=arduino/micro
micro.build.extra_flags={build.usb_flags}
micro.build.core=Cosa:cosa

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0x3c00).
nano.name=Cosa Arduino Nano (ATmega328/BOOT_168)
nano.upload.tool=avrdude
nano.upload.protocol=arduino
nano.upload.maximum_size=30720
nano.upload.maximum_data_size=2048
nano.upload.maximum_eeprom_size=1024
nano.upload.speed=57600

nano.bootloader.tool=avrdude
nano.bootloader.low_fuses=0xff
nano.bootloader.high_fuses=0xda
nano.bootloader.extended_fuses=0x05

