mikaelpatel/Cosa/boards.txt
nano.build.mcu=atmega328p
nano.build.f_cpu=16000000L
nano.build.board=ARDUINO_NANO
nano.build.variant=arduino/nano
nano.build.core=Cosa:cosa

# AVR:ATmega32U4
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.6 V. Serial program downloading enabled
# Boot Reset vector enable (2048 words, 0x3800).
pro-micro.name=Cosa Arduino Pro Micro (ATmega32U4/Caterina)
pro-micro.upload.tool=avrdude
pro-micro.upload.protocol=avr109
pro-micro.upload.maximum_size=28672
pro-micro.upload.maximum_data_size=2560
pro-micro.upload.maximum_eeprom_size=1024
pro-micro.upload.speed=57600
pro-micro.upload.disable_flushing=true
pro-micro.upload.use_1200bps_touch=true
pro-micro.upload.wait_for_upload_port=true

pro-micro.bootloader.path=caterina
pro-micro.bootloader.tool=avrdude
pro-micro.bootloader.low_fuses=0xff
pro-micro.bootloader.high_fuses=0xd8
pro-micro.bootloader.extended_fuses=0xcb

pro-micro.build.mcu=atmega32u4
pro-micro.build.f_cpu=16000000L
pro-micro.build.vid=0x2341
pro-micro.build.pid=0x8037
pro-micro.build.usb_product="Arduino Pro Micro"
pro-micro.build.board=ARDUINO_PRO_MICRO
pro-micro.build.variant=arduino/pro-micro
pro-micro.build.extra_flags={build.usb_flags}
pro-micro.build.core=Cosa:cosa

# AVR:ATmega32U4
# Ext Crystal Osc.=8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.6 V. Serial program downloading enabled
# Boot Reset vector enable (2048 words, 0x3800).
pro-micro-8.name=Cosa Arduino Pro Micro (ATmega32U4/Caterina, 3.3V, 8 MHz)
pro-micro-8.upload.tool=avrdude
pro-micro-8.upload.protocol=avr109
pro-micro-8.upload.maximum_size=28672
pro-micro-8.upload.maximum_data_size=2560
pro-micro-8.upload.maximum_eeprom_size=1024
pro-micro-8.upload.speed=57600
pro-micro-8.upload.disable_flushing=true
pro-micro-8.upload.use_1200bps_touch=true
pro-micro-8.upload.wait_for_upload_port=true

pro-micro-8.bootloader.path=caterina
pro-micro-8.bootloader.tool=avrdude
pro-micro-8.bootloader.low_fuses=0xff
pro-micro-8.bootloader.high_fuses=0xd8
pro-micro-8.bootloader.extended_fuses=0xcb

pro-micro-8.build.mcu=atmega32u4
pro-micro-8.build.f_cpu=8000000L
pro-micro-8.build.vid=0x2341
pro-micro-8.build.pid=0x8037
pro-micro-8.build.usb_product="Arduino Pro Micro"
pro-micro-8.build.board=ARDUINO_PRO_MICRO
pro-micro-8.build.variant=arduino/pro-micro
pro-micro-8.build.extra_flags={build.usb_flags}
pro-micro-8.build.core=Cosa:cosa

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0x3c00).
pro-mini.name=Cosa Arduino Pro Mini (ATmega328/BOOT_168)
pro-mini.upload.tool=avrdude
pro-mini.upload.protocol=arduino
pro-mini.upload.maximum_size=30720
pro-mini.upload.maximum_data_size=2048
pro-mini.upload.maximum_eeprom_size=1024
pro-mini.upload.speed=57600

pro-mini.bootloader.tool=avrdude
pro-mini.bootloader.low_fuses=0xff
pro-mini.bootloader.high_fuses=0xda
pro-mini.bootloader.extended_fuses=0x05

pro-mini.build.mcu=atmega328p
pro-mini.build.f_cpu=16000000L
pro-mini.build.board=ARDUINO_PRO_MINI
pro-mini.build.variant=arduino/pro-mini
pro-mini.build.core=Cosa:cosa

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0x3c00).
pro-mini-8.name=Cosa Arduino Pro Mini (ATmega328/BOOT_168, 3.3V, 8 MHz)
pro-mini-8.upload.tool=avrdude
pro-mini-8.upload.protocol=arduino
pro-mini-8.upload.maximum_size=30720
pro-mini-8.upload.maximum_data_size=2048
pro-mini-8.upload.maximum_eeprom_size=1024
pro-mini-8.upload.speed=57600

pro-mini-8.bootloader.tool=avrdude
pro-mini-8.bootloader.low_fuses=0xFF
pro-mini-8.bootloader.high_fuses=0xDA
pro-mini-8.bootloader.extended_fuses=0x05

pro-mini-8.build.mcu=atmega328p
pro-mini-8.build.f_cpu=8000000L
pro-mini-8.build.board=ARDUINO_PRO_MINI
pro-mini-8.build.variant=arduino/pro-mini
pro-mini-8.build.core=Cosa:cosa

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (256 words, 0x3f00).
uno.name=Cosa Arduino Uno (ATmega328/Optiboot)
uno.upload.tool=avrdude
uno.upload.protocol=arduino
uno.upload.maximum_size=32256
uno.upload.maximum_data_size=2048
uno.upload.maximum_eeprom_size=1024
uno.upload.speed=115200

uno.bootloader.tool=avrdude
uno.bootloader.low_fuses=0xff
uno.bootloader.high_fuses=0xde
uno.bootloader.extended_fuses=0x05

uno.build.mcu=atmega328p
uno.build.f_cpu=16000000L
uno.build.board=ARDUINO_UNO
uno.build.variant=arduino/uno
uno.build.core=Cosa:cosa

##
# BREADBOARDS
##

# AVR:ATtiny84
# Int. RC Osc.8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms
# Brown-out detection disabled. Serial program downloading enabled
attiny84-8.name=Cosa Breadboard (ATtiny84, 8 MHz internal clock)
attiny84-8.upload.tool=avrdude
attiny84-8.upload.protocol=stk500v1
attiny84-8.upload.speed=19200
attiny84-8.upload.maximum_size=8192
attiny84-8.upload.maximum_data_size=512
attiny84-8.upload.maximum_eeprom_size=512

attiny84-8.bootloader.tool=avrdude
attiny84-8.bootloader.low_fuses=0xe2
attiny84-8.bootloader.high_fuses=0xdf
attiny84-8.bootloader.extended_fuses=0xff
attiny84-8.bootloader.unlock_bits=0xff
attiny84-8.bootloader.lock_bits=0xff
attiny84-8.bootloader.file=attiny84-8.hex

attiny84-8.build.mcu=attiny84
attiny84-8.build.f_cpu=8000000L
attiny84-8.build.board=BREADBOARD_ATTINYX4
attiny84-8.build.variant=arduino/attinyx4
attiny84-8.build.core=Cosa:cosa

# AVR:ATtiny85
# Int. RC Osc.8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms
# Brown-out detection disabled. Serial program downloading enabled
attiny85-8.name=Cosa Breadboard (ATtiny85, 8 MHz internal clock)
attiny85-8.upload.tool=avrdude
attiny85-8.upload.protocol=stk500v1
attiny85-8.upload.speed=19200
attiny85-8.upload.maximum_size=8192
attiny85-8.upload.maximum_data_size=512
attiny85-8.upload.maximum_eeprom_size=512

